In [1]:
### PANDAS ###

In [2]:
import pandas as pd

In [3]:
dataset = "data.csv" #Initialize DataSet

In [4]:
members = pd.read_csv(dataset) #Read dataset in to dataframe 'members'

In [5]:
members  #Print DataSet

      Name     Title  Age
0   Rizwan       Dad   35
1     Sana       Mom   28
2    Yahya       Son    4
3    Hafsa  Daughter    2
4    Abdul   Grandpa   70
5   Kareem     Uncle   45
6   Jaffar     Uncle   40
7  Fathima     Niece   16
8   Amreen     Niece   14

In [6]:
members.columns #Print column header

Index(['Name', 'Title', 'Age'], dtype='object')

In [7]:
members.Name #Print Name Col

0     Rizwan
1       Sana
2      Yahya
3      Hafsa
4      Abdul
5     Kareem
6     Jaffar
7    Fathima
8     Amreen
Name: Name, dtype: object

In [8]:
members.Age #Print Age col

0    35
1    28
2     4
3     2
4    70
5    45
6    40
7    16
8    14
Name: Age, dtype: int64

In [9]:
members['Age'] #Print Age col

0    35
1    28
2     4
3     2
4    70
5    45
6    40
7    16
8    14
Name: Age, dtype: int64

In [10]:
members.head() #1st 5 entries

     Name     Title  Age
0  Rizwan       Dad   35
1    Sana       Mom   28
2   Yahya       Son    4
3   Hafsa  Daughter    2
4   Abdul   Grandpa   70

In [11]:
members.tail() #Last 5 entries

      Name    Title  Age
4    Abdul  Grandpa   70
5   Kareem    Uncle   45
6   Jaffar    Uncle   40
7  Fathima    Niece   16
8   Amreen    Niece   14

In [12]:
def change_title(title):
    i = title.strip().lower()
    if i == 'dad':
        return 'Father'
    if i == 'mom':
        return 'Mother'
    return title

In [13]:
update_title = pd.read_csv(dataset, converters={'Title':change_title})
# 1 - Read csv that is assigned to dataset
#2 - converters : 
    #a - Passes Title column data to the function
    #b - Function return the new element for impacted title data
    #c - New element is updated in new dataframe 'updated_title'

In [14]:
update_title

      Name     Title  Age
0   Rizwan    Father   35
1     Sana    Mother   28
2    Yahya       Son    4
3    Hafsa  Daughter    2
4    Abdul   Grandpa   70
5   Kareem     Uncle   45
6   Jaffar     Uncle   40
7  Fathima     Niece   16
8   Amreen     Niece   14

In [15]:
fruits_dataset = 'fruits.csv' #Assign csv to dataset

In [16]:
fruits_dataframe = pd.read_csv(fruits_dataset) #Initialize data frame

In [17]:
fruits_dataframe

     apple:5
0  banana:10
1   guava:11
2     kiwi:2
3    mango:7
4     pomo:9
5    melon:1

In [18]:
#Default pandas use ',' as delimiter; to define new delimiter
fruits_dataframe = pd.read_csv(fruits_dataset, sep=':')

In [19]:
fruits_dataframe

    apple   5
0  banana  10
1   guava  11
2    kiwi   2
3   mango   7
4    pomo   9
5   melon   1

In [20]:
#Update column header
fruits_dataframe = pd.read_csv(fruits_dataset, sep=':', names=['Fruits', 'Quantity'])

In [21]:
fruits_dataframe

   Fruits  Quantity
0   apple         5
1  banana        10
2   guava        11
3    kiwi         2
4   mango         7
5    pomo         9
6   melon         1

In [22]:
fruits_dataframe.Fruits

0     apple
1    banana
2     guava
3      kiwi
4     mango
5      pomo
6     melon
Name: Fruits, dtype: object

In [23]:
fruits_dataframe.Quantity

0     5
1    10
2    11
3     2
4     7
5     9
6     1
Name: Quantity, dtype: int64

In [24]:
# Renaming the column
fruits_dataframe.rename(columns={'Fruits':'FreshFruits'}, inplace=True)

In [25]:
fruits_dataframe

  FreshFruits  Quantity
0       apple         5
1      banana        10
2       guava        11
3        kiwi         2
4       mango         7
5        pomo         9
6       melon         1

In [26]:
fruits_dataframe.FreshFruits

0     apple
1    banana
2     guava
3      kiwi
4     mango
5      pomo
6     melon
Name: FreshFruits, dtype: object

In [27]:
#Fruits whoes quantity greater than 5
fruits_dataframe[fruits_dataframe["Quantity"] > 5]

  FreshFruits  Quantity
1      banana        10
2       guava        11
4       mango         7
5        pomo         9

In [28]:
fruits_dataframe[fruits_dataframe.Quantity > 5]

  FreshFruits  Quantity
1      banana        10
2       guava        11
4       mango         7
5        pomo         9

In [29]:
#Filter data based on its name
fruits_dataframe[fruits_dataframe.FreshFruits == 'pomo']

  FreshFruits  Quantity
5        pomo         9